Обработки/Reports/_ОтчетОДоходахИРасходахНефтегарант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахНефтегарант</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахНефтегарант/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах (Нефтегарант)",
		"0.38",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
	ЭтотОбъект.КлючТекущегоВарианта	= НастройкиОтчета.КлючТекущегоВарианта;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КлючТекущегоВарианта) Тогда 
		ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза";
	КонецЕсли;
		
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
    Настройки.Добавить("АвтоматическаяОтправка");
    Настройки.Добавить("АдресЭлектроннойПочты");
    Настройки.Добавить("АдресОтправителя");
	Настройки.Добавить("КлючТекущегоВарианта");	
	
	Возврат Настройки;

КонецФункции

//Функция ПреобразоватьИмя(вхСтрока)
//	
//	//П02010100
//	//2.1.1
//	
//	Ч1 = СтрЗаменить(Сред(вхСтрока,2,2), "0", "");
//	Ч2 = СтрЗаменить(Сред(вхСтрока,4,2), "0", "");
//	Ч3 = СтрЗаменить(Сред(вхСтрока,6,2), "0", "");
//	Ч4 = СтрЗаменить(Сред(вхСтрока,8,2), "0", "");
//	
//	Ч4 = ?(ПустаяСтрока(Ч4), "", "."+Ч4);
//	Ч3 = ?(ПустаяСтрока(Ч3), "", "."+Ч3);
//	Ч2 = ?(ПустаяСтрока(Ч2), "", "."+Ч2);
//	
//	Возврат Ч1+Ч2+Ч3+Ч4;
//	
//	
//КонецФункции


Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант,КлючТекущегоВарианта");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");	
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
	
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза" Тогда
		СекцияДанные = "Данные";
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза2023" Тогда
		СекцияДанные = "Данные2023";
	КонецЕсли;	
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", СекцияДанные, "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	Если ТаблицаНастройки.Количество() = 0 Тогда
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

		Возврат;
		
	КонецЕсли;	
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "П010606", "П020308", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	//вывод формы
	Если ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза" Тогда		
		Отчет = ПолучитьМакет("Отчет");	
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза2023" Тогда
		Отчет = ПолучитьМакет("Отчет2023");
	КонецЕсли;
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	ОбластьПодписи = Отчет.ПолучитьОбласть("Подписи");

	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	//ОбластьОтчет.Параметры.ДатаОтчета				= Формат(ПараметрыШапки.ДатаОтчета, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	
	//ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеДоходы", ОбластьОтчет, Отчет, ПрочиеДоходы);
	//ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеРасходы", ОбластьОтчет, Отчет, ПрочиеРасходы);	
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	// Подписи		
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);

	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбластьПодписи.Рисунки.ФИОРуководителя.Значение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ОбластьПодписи.Рисунки.ДолжностьРуководителя.Значение = СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий;
		
		ОбластьПодписи.Параметры.ДатаФормирования =  Формат(ТекущаяДата(), "ДФ='«dd» ММММ yyyy ""г.""'");
		ДокументРезультат.Вывести(ОбластьПодписи);
	КонецЕсли;
		
	//Расшифровка
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры	
	
Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	Если ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза" Тогда
		СекцияДанные = "Данные";
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "НалоговаяБаза2023" Тогда
		СекцияДанные = "Данные2023";
	КонецЕсли;		
	
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", СекцияДанные, "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры
